CogneuroResearch/cogneuro-alexa/firmware/box3-capture/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# The BOX-3 module is N16R8: 16MB flash, 8MB octal PSRAM. Capture buffers live in PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# HTTPS to Vercel using the bundled root CAs.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_INSECURE=n

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Default 1MB app partition overflows; the N16R8 has 16MB flash.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
